Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཡི་མིག་ཀྱང་ཐོགས་པར་མི་འགྱུར་ཏེ།
en: Their sight is free of impediment

source: །ཕྱོགས་བཅུ་དག་གི་གཟུགས་མང་མཐོང་བར་འགྱུར།
en: And they see many forms in the ten directions. They are guides for all the beings

source: །ཇི་སྙེད་ཕྱོགས་བཅུ་ཡི་ནི་སྲིད་པ་ན། །སེམས་ཅན་ཡོད་དགུ་དེ་དག་འདྲེན་པར་གྱུར། །བསྐལ་པ་བྱེ་བ་བརྒྱ་ཕྲག་མང་པོར་ནི།
en: Who are present throughout the ten directions. {68}

source: །དེ་དག་དེ་ཡི་ཕན་ཡོན་ཀུན་བརྗོད་ཅིང་།
en: “If one were to describe the entirety of their benefits,

source: །སྤོབས་པ་ཡི་ནི་རབ་ཏུ་བཤད་མཛད་ཀྱང་།
en: Even if one spoke with eloquence For many billions of eons,

source: །སྔོན་གྱི་སྤྱོད་པའི་བསྔགས་པ་ཟད་མི་ནུས།
en: One could not finish praising their past conduct. Any human who possesses

source: །ཏིང་འཛིན་མཚུངས་མེད་རྡུལ་དང་བྲལ་བ་འདི། །སྐྱེས་བུ་སུ་གང་འཛིན་པར་བྱེད་པ་ནི།
en: This unequaled, stainless samādhi

source: །སངས་རྒྱས་དག་གི་ནོར་རྣམས་མི་ཟད་དེ།
en: Has the inexhaustible wealth of the buddhas

source: །ཤིན་ཏུ་རྒྱ་ཆེ་ཡེ་ཤེས་རྒྱ་མཚོ་བཞིན།
en: And an extremely vast ocean of wisdom.” {69}

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་བདུན་པའོ།། །།དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Conclusion of the thirty-seventh chapter, “Teaching the Aspect of Correct Conduct.” Yaśaḥprabha Chapter 38

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངོ་མཚར་དང་། །རྨད་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་འདི་དག་དང་། གཞན་ཡང་ཚད་མེད་པ་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for these and countless other wonderful and marvelous bodhisattva qualities, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should hear this revealed equality of the nature of all phenomena samādhi and obtain it, understand it, preserve it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.

source: རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པར་བསྒོམ་པས་བསྒོམ་པར་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱ། དེས་བཟོད་པའི་སྟོབས་བསྒོམ་པར་བྱ།
en: “They should meditate on the strength of patience, rely on patience, and promulgate patience.

source: བཟོད་པ་བསྟེན་པར་བྱ། མང་དུ་བྱ། ཆོས་ལ་དོན་དུ་གཉེར་བ་དང་། ཆོས་འདོད་པ་དང་། ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། ཆོས་དང་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ཞུགས་པར་བྱའོ། །སངས་རྒྱས་མཆོད་པ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ།
en: They should be dedicated to the Dharma, long for the Dharma, possess the Dharma, engage in the Dharma in a way that accords with the Dharma, and apply themselves to making offerings to the buddhas.

source: །དེས་གནས་གསུམ་ལ་བརྩོན་པར་བྱ་སྟེ།
en: “They should apply themselves to three points.

source: གསུམ་གང་ཞེ་ན།
en: What are the three points?

source: འདི་ལྟ་སྟེ། ཉོན་མོངས་པ་ཟད་པ་དང་། བསོད་ནམས་ཀྱི་ཞིང་དུ་གྱུར་པ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་འདོད་པས་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པར་བྱའི་འཇིག་རྟེན་གྱི་བདེ་བ་ལ་རེག་པར་འདོད་པའི་ཕྱིར་ནི་མ་ཡིན་ཏེ།
en: They are ending the kleśas, mastering merit, and generating the roots of goodness out of longing for the wisdom of the buddhas and not out of desire for reaching worldly happiness.

source: གནས་གསུམ་པོ་དེ་དག་ལ་མངོན་པར་བརྩོན་པར་བྱའོ།
en: Apply yourself to those three points.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་དོན་འདི་ཉིད་བསྟན་པའི་ཕྱིར་སྔོན་བྱུང་བའི་གཏམ་བསྟན་པ་འདི་དག་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Thereupon the Bhagavān, to explain what this meant, related an account of the past by chanting the following extensive verses to the youth Candraprabha: “Young man, listen to me as I tell you

source: །བསྐལ་པ་སྟོང་དུ་ཇི་ལྟར་ངས་སྤྱད་པ། །གཞོན་ནུར་གྱུར་པ་ང་ལས་མཉན་པར་གྱིས།
en: How I practiced for thousands of eons.

source: །ཏིང་འཛིན་བཟང་པོ་དམ་པ་འདི་ཚོལ་ཕྱིར།
en: Seeking this sublime, excellent samādhi,

source: །སངས་རྒྱས་དག་ནི་སྟོང་ཕྲག་བརྒྱ་ཡང་མཆོད།
en: I made offerings to hundreds of thousands of buddhas. {1}

source: །དེ་ལྟར་བསྐལ་པ་འདས་པ་བསམ་ཡས་སུ།
en: “In that way, after countless eons had passed,

source: །ཞིང་བརྒྱ་ཡི་ནི་བྱེ་མ་ཅི་ཡོད་པ།
en: As numerous as the grains of sand in a hundred worlds,

source: །དཔེར་བསྟེན་དེ་སྙེད་འདས་པར་གྱུར་པ་ན།
en: When such a number had passed by

source: །བྱེ་བ་སྟོང་ཕྲག་དྲུག་ཅུ་མི་ཉུང་བ།
en: “There were no fewer than six hundred billion

source: །རྒྱལ་བ་དེ་ཡི་ཚོགས་ནི་བྱུང་གྱུར་ཏེ།
en: In the saṅgha of that jina.

source: །ཐམས་ཅད་ཟག་པ་མེད་ཅིང་ཉོན་མོངས་ཟད།
en: All were without ouflows, their kleśas had come to an end,

source: །རྣམ་ཐར་བརྒྱད་ལ་གནས་པའི་བསམ་གཏན་པ།
en: They had dhyāna, and were established in the eight liberations. {3}

source: །དེ་ཡི་དུས་ན་ས་འདི་ཐམས་ཅད་ཀྱང་།
en: “At that time the entire surface of this earth

source: །བདེ་ཞིང་ལོ་ལེགས་འཁྲུག་པ་མེད་པར་གྱུར།
en: Was pleasant and had good harvests, and no disorder.

source: །མི་རྣམས་ཐམས་ཅད་སྐྱིད་ཅིང་བདེ་དང་ལྡན།
en: All the people were joyful and happy,

source: །མི་ཡི་བདེ་བ་དག་གིས་རྒྱས་པར་གྱུར།
en: And the happiness of humanity was widespread. {4}

source: །ཐམས་ཅད་བསོད་ནམས་སྟོབས་དང་ལྡན་པ་སྟེ།
en: “Everyone possessed the strength of merit.

source: །བལྟ་ན་སྡུག་ཅིང་དེ་བཞིན་དགའ་བར་གྱུར།
en: They were attractive and beloved.

source: །ཐམས་ཅད་ཕྱུག་ཅིང་ནོར་མང་འབྱོར་བ་སྟེ།
en: All were rich and possessed much wealth,

source: །ལུས་ནི་ལྷ་ཡི་བདེ་དང་ལྡན་པར་གྱུར།
en: And physically they experienced divine pleasures. {5}

source: །དེས་ཤིང་བརྟུལ་ཞུགས་བཟང་ལ་ཉོན་མོངས་ཆུང་།
en: “They were gentle, with good discipline and few kleśas.

source: །བཟོད་པའི་སྟོབས་ལ་དཔའ་ཞིང་བྱད་གཟུགས་བཟང་།
en: They enjoyed the strength of patience and had good features.

source: །ལྷ་ཡི་གནས་ན་ལྷ་ཡི་སྲས་པོ་བཞིན།
en: They were like devas within the paradises.

source: །ཚུལ་ཁྲིམས་ཡོན་ཏན་འཆང་ཞིང་བློ་གྲོས་ལྡན།
en: They possessed the qualities of correct conduct and understanding. {6}

source: །དེ་ཡི་དུས་ན་ས་བདག་བྱུང་བ་ནི།
en: “At that time there was a sovereign,

source: །རྒྱལ་པོ་མེ་ཏོག་མཆོག་ཅེས་བྱ་བ་ཡིན།
en: A king named Varapuṣpasa.

source: །དེ་ཡི་བུ་ཡང་ལྔ་བརྒྱར་ཚང་བར་བྱུང་།
en: He had no fewer than five hundred sons,

source: །དྲན་དང་ལྡན་ཞིང་རྟོགས་དང་ལྡན་པར་གྱུར།
en: All endowed with mindfulness and realization. {7}

source: །རྒྱལ་པོའི་བུ་དེ་ཡིས་ཀྱང་རྒྱལ་བ་ཡི།
en: “That king and his sons offered to the Jina, To that compassionate one,

source: །སྐྱེད་མོས་ཚལ་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་དག །ཐམས་ཅད་མེ་ཏོག་འབྲས་བུས་བརྒྱན་པ་ཡང་། །ཐུགས་རྗེ་ལྡན་པ་དེ་ལ་རབ་ཏུ་ཕུལ།
en: Six hundred thousand parks, All beautified by flowers and fruits, {8}

source: །སྐྱེད་མོས་ཚལ་ནི་བརྒྱ་སྟོང་སྣ་ཚོགས་དང་། །འཆག་ས་མལ་སྟན་བཞུགས་གནས་སྟོང་རྣམས་དང་། །ཆོས་གོས་ཀྱང་ནི་བྱེ་བ་བརྒྱ་སྟོང་གིས།
en: “And a hundred thousand various parks With thousands of walkways, seats, and beds, And with a trillion Dharma robes

source: །འཆག་ས་བཞུགས་གནས་རྣམས་སུ་གདིང་བ་བྱས། །དེ་ལྟར་རྣམ་པ་དུ་མ་སྟོང་དག་དང་། །དགེ་སྦྱོང་དག་གི་ལོངས་སྤྱོད་ཇི་སྙེད་པ།
en: Spread on the ground where they walked and sat. {9}

source: །རྒྱལ་བའི་བུ་ནི་ཤིན་ཏུ་ཡིད་དད་པས།
en: “Thus the king with great faith

source: །བདེ་གཤེགས་དེ་ལ་ཐམས་ཅད་ཉེ་བར་ཕུལ།
en: Presented to that Sugata In many thousands of ways Whatever renunciants would enjoy. {10}

source: །རྒྱལ་པོ་དེ་ཡང་དགེ་བའི་ལས་བཅུ་ཡི།
en: “That king, who followed the path Of the ten good actions,

source: །ལམ་ལ་རབ་ཏུ་གནས་པར་གྱུར་ནས་སུ།
en: Came to see the Guide, accompanied by

source: །སྐྱེ་བོ་སྲོག་ཆགས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས། །མདུན་དུ་བདར་ཏེ་འདྲེན་པ་ལྟ་བར་སོང་།
en: A hundred thousand trillion beings. {11}

source: །མེ་ཏོག་དང་ནི་བྱུག་པ་བདུག་པ་དང་། །གདུགས་དང་རྒྱལ་མཚན་སིལ་སྙན་ཐོགས་ནས་སུ།
en: “Holding flowers, perfumes, and incense, Parasols, banners, and musical instruments,

source: །རྒྱལ་བ་དེ་ལ་དེ་ཡིས་མཆོད་བྱས་ཏེ།
en: He made offerings to that Jina,

source: །ཐལ་མོ་སྦྱར་ནས་སྤྱན་སྔར་འདུག་པར་གྱུར།
en: And with his hands in homage sat before him. {12}

source: །ལྷ་དང་མི་དང་ལྷ་མིན་གནོད་སྦྱིན་དང་། །དགེ་སློང་སྟོང་ཡང་དེ་ཚེ་དགའ་བར་གྱུར།
en: “The thousands of bhikṣus were pleased, As were the devas, humans, asuras, and yakṣas, wondering,

source: །རྒྱལ་བ་མཆོད་པ་འདི་ནི་ལུང་སྟོན་ཏམ།
en: ‘The Jina to whom these offerings were made, will he give a prophecy?

source: །མི་ཡི་དབང་པོ་ལེགས་པར་ཆོས་གསུང་ངམ།
en: Will this lord of humans teach the Dharma?’ {13}

source: །རྒྱལ་པོའི་བུ་དེ་ཡི་ནི་བསམ་པ་དང་། །བླ་མེད་སེམས་ཀྱང་རང་བྱུང་མཁྱེན་ནས་ནི།
en: “The self-arisen one knew their thoughts And knew the king’s supreme motivation,

source: །མོས་པའི་གནས་ལ་ཕ་རོལ་ཕྱིན་པ་ཡིས།
en: That his aspiration was to the further shore,

source: །དེ་ལ་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་དོ།
en: And therefore taught him the samādhi of peace. {14}

source: །གང་ཚེ་བདེ་བར་གཤེགས་པས་གསུང་ཕྱུང་བ།
en: “When the Sugata’s voice came forth

source: །དེ་ཚེ་ནགས་ཚལ་བཅས་པའི་ས་ཡང་གཡོས།
en: The earth and its forests shook.

source: །ནམ་མཁའ་ལས་ནི་མེ་ཏོག་ཆར་ཀྱང་བབ།
en: A rain of flowers fell from the sky

source: །ས་ལས་པད་མ་བརྒྱ་དག་བྱུང་བར་གྱུར།
en: And hundreds of lotuses appeared out of the ground. {15}

source: །སྟོན་པ་དོན་གྱི་ཚིག་ལ་རབ་བསླབས་པས།
en: “The Teacher had trained in the words and their meaning,

source: །བསམ་པ་མཁྱེན་ནས་འདྲེན་པས་ལུང་བསྟན་ཏེ།
en: And the Guide, knowing the king’s thoughts, gave a prophecy.

source: །མི་ཡི་དབང་པོས་ཏིང་འཛིན་ཞི་བ་བཤད།
en: That lord of men taught the samādhi of peace.

source: །དེ་ཡི་དོན་ཚིག་རྣམས་ཀྱང་མཉན་པར་གྱིས།
en: Listen to these words and their meaning. {16}

source: །སྲིད་པ་ཐམས་ཅད་སྲིད་པ་མེད་པ་སྟེ།
en: “ ‘All existences are nonexistent: they are concepts,

source: །ཀུན་བརྟགས་གསོག་དང་སྨིག་རྒྱུ་འདྲ་བ་ཡིན།
en: They are insubstantial, they are like mirages and illusions.

source: །སྒྱུ་མ་ཇི་བཞིན་གློག་དང་སྤྲིན་འདྲ་སྟེ།
en: They are like lightning and clouds, unstable and empty.

source: །སྟོང་གཡོ་བདག་དང་སེམས་ཅན་སྲོག་ཀུན་མེད།
en: All are without a self, without a being, without a soul. {17}

source: །གཟོད་མ་ནས་ནི་སྟོང་ཞིང་མ་འོངས་ཆོས།
en: “ ‘Primordially empty, phenomena do not come.

source: །སོང་བ་མེད་ཅིང་གནས་མེད་གནས་ཀྱིས་དབེན།
en: They have not come, they are not present, and they have no location.

source: །སྒྱུ་མའི་རང་བཞིན་རྟག་ཏུ་སྙིང་པོ་མེད།
en: They are always without essence; they have the nature of an illusion.

source: །ཐམས་ཅད་དག་ཅིང་རྣམ་དག་ནམ་མཁའ་བཞིན།
en: They are all pure—completely pure like space. {18}

source: །མི་སྔོ་མི་སེར་དཀར་པོ་མ་ཡིན་ཏེ།
en: “ ‘They are neither blue, nor yellow, nor white.

source: །མིང་ནི་གསོག་གྱུར་སྒྲ་ཡི་རང་བཞིན་ཡིན།
en: Those are just names, vacuous, with a nature that is just sound.

source: །སེམས་ནི་དབེན་ཞིང་སེམས་མེད་རང་བཞིན་ཏེ།
en: They are devoid of mind; their nature is not mind.

source: །སྐད་ཅིག་ཡིན་པས་ཐམས་ཅད་སྒྲ་དང་བྲལ།
en: They are momentary and are devoid of sound. {19}

source: །བཤད་པ་ན་ཡང་ཡི་གེ་འཕོ་བ་མེད།
en: “ ‘Words do not go anywhere if spoken.

source: །མ་བཤད་ན་ཡང་ཡི་གེ་འགྲིབ་མི་འགྱུར།
en: Words are not diminished if not spoken.

source: །ཡི་གེ་དག་ནི་ཕྱོགས་སུའང་མི་འགྲོ་སྟེ།
en: Words do not go in any direction.

source: །ཡི་གེ་གང་ནས་ཀྱང་ནི་འོངས་མ་ཡིན།
en: Words do not come from anywhere. {20}

source: །ཡི་གེ་མི་ཟད་ཟད་ཅིང་འགགས་པ་སྟེ།
en: “ ‘Words do not perish, cease, or end,

source: །བཤད་པར་བྱས་སམ་བཤད་པར་མ་བྱས་ཀྱང་།
en: Whether they are spoken or unspoken.

source: །ཡི་གེ་འདི་དག་རྟག་པར་མི་ཟད་བརྗོད།
en: Words are said to be always unceasing.

source: །གང་གིས་ཡོངས་ཤེས་དེ་ཡང་ཟད་མི་འགྱུར།
en: Those who know that will be unceasing. {21} “ ‘In the past, hundreds of thousands of buddhas

source: །ཆོས་ནི་སྟོང་ཕྲག་བརྒྱ་དག་རབ་བརྗོད་ནས། །སངས་རྒྱས་བརྒྱ་སྟོང་དག་ནི་གང་འདས་པ།
en: Have taught the Dharma hundreds of thousands of times.

source: །ཆོས་ཀྱང་མ་ཟད་ཡི་གེའང་ཟད་མ་གྱུར།
en: But the Dharma does not cease; words do not cease,

source: །སྐྱེ་བ་ཡང་མེད་དེ་ཕྱིར་མི་ཟད་པ།
en: And as there is no arising, there is no cessation. {22}

source: །གང་གིས་མི་ཟད་ཆོས་རྣམས་རབ་ཤེས་པ།
en: “ ‘Those who know the unceasing Dharma

source: །རྟག་ཏུ་མི་ཟད་པ་ཡི་ཆོས་ཤེས་པས།
en: Will always know the unceasing Dharma.

source: །མདོ་སྡེ་བརྒྱ་སྟོང་དག་ནི་བཤད་བྱས་ཀྱང་།
en: Having taught a hundred thousand sūtras,

source: །ཆོས་རྣམས་ཐམས་ཅད་ཡི་གེ་མེད་པར་ཤེས།
en: They know that the Dharma is devoid of words. {23}

source: །རྒྱལ་བའི་ཆོས་ནི་གང་དག་རབ་སྟོན་པ།
en: “ ‘The Dharma that the jinas have taught

source: །དེ་ཡང་མི་ཟད་པས་ན་མི་མཐོང་སྟེ།
en: Is unceasing and therefore is not seen.

source: །ཆོས་འདི་སྔ་ནས་བདག་མེད་སེམས་ཅན་མེད།
en: The Dharma is primordially without a self, without a being.

source: །དེ་དག་རབ་ཏུ་སྟོན་ཀྱང་ཟད་མི་འགྱུར།
en: Although it is taught, it does not cease. {24}

source: །མཁས་པ་དེ་ནི་ཚིག་ཀུན་སྨྲ་བྱེད་ཀྱང་།
en: “ ‘The wise teach using all words,

source: །ཚིག་གིས་སེམས་ནི་འཕྲོགས་པར་མི་འགྱུར་ཏེ།
en: But their minds are not captivated by the words.

source: །ཚིག་རྣམས་ཐམས་ཅད་རི་ཡི་བྲག་ཅ་བཞིན།
en: All words are like echoes on a mountain,

source: །དེ་ཕྱིར་ནམ་ཡང་ཚིག་ལ་ཆགས་མི་འགྱུར།
en: So therefore never have attachment to words. {25}

source: །དེ་ནི་སྒྱུ་མའི་ཚིག་གིས་ཆོས་སྟོན་ཏེ།
en: “ ‘The Dharma is taught through illusory words

source: །ཚིག་དེ་ཐམས་ཅད་དེ་ཡི་མོད་ལ་འགགས།
en: And all those words cease in that instant.

source: །ཚིག་དེ་ཡི་ནི་མཚན་ཉིད་ཅི་འདྲ་བ།
en: That which is the characteristic of those words

source: །ཆོས་རྣམས་ཀུན་ཀྱང་མཚན་ཉིད་དེ་འདྲར་གྱུར།
en: Is the characteristic that all phenomena have. {26}

source: །ཆོས་ཀུན་མཚན་གཞི་མེད་ཅིང་མཚན་གཞི་བྲལ།
en: “ ‘All phenomena have no characteristics, are devoid of characteristics;

source: །ཐམས་ཅད་མཚན་མེད་མཚན་ཉིད་རྣམ་པར་དག །རྟག་ཏུ་དབེན་ཞིང་གཙང་བ་ནམ་མཁའ་བཞིན།
en: They all have no characteristics, and are pure of characteristics. They are always empty, and they are as pure as space.

source: །མདོར་ན་དེ་དག་བགྲང་བར་ཉེར་མི་འགྱུར།
en: In brief, they cannot be enumerated. {27}

source: །འདུས་བྱས་འདུས་མ་བྱས་ཀུན་དབེན་པ་སྟེ།
en: “ ‘They are devoid of “composite” or “noncomposite,”

source: །དྲང་སྲོང་དེ་དག་ལ་ནི་རྣམ་རྟོག་མེད།
en: And the sages have no concepts concerning them;

source: །འགྲོ་བ་ཀུན་ཏུ་འདུས་མ་བྱས་ཐོབ་པས།
en: They have arrived at the noncomposite in all the existences of beings

source: །ལྟ་བ་དག་ལས་ཁོར་མོར་རྣམ་པར་དབེན།
en: And are always devoid of contrived views. {28}

source: །གང་དག་འདི་འདྲའི་ཆོས་རྣམས་ཤེས་པ་ནི།
en: “ ‘The one whose mind is at rest in that nature

source: །རྟག་ཏུ་མ་ཆགས་མི་གཏུམ་མ་རྨོངས་ཏེ།
en: Is always without desire, anger, and ignorance. The one who knows phenomena in that way

source: །དེ་ཡི་སེམས་ནི་རང་བཞིན་མཉམ་པར་བཞག །དེ་ནི་ཏིང་འཛིན་སྟོབས་ཅན་སྟོབས་དང་ལྡན།
en: Becomes strong with the strength of samādhi. {29}

source: །བྲག་ཕུག་རི་དང་གཅོང་རོང་ཀླུང་རྣམས་སུ། །རྐྱེན་གྱིས་ཇི་ལྟར་བྲག་ཅ་འབྱུང་བ་ལྟར།
en: “ ‘Just as echoes are created through conditions In caves, mountains, and canyons,

source: །དེ་བཞིན་འདུས་བྱས་འདི་ཀུན་རིག་པར་གྱིས།
en: All that is composite is known to be the same:

source: །འཇིག་རྟེན་ཐམས་ཅད་སྒྱུ་མ་སྨིག་རྒྱུ་བཞིན།
en: The entire world is like an illusion, a mirage. {30}

source: །གང་དུ་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་པ།
en: “ ‘This samādhi of peace is taught by one

source: །ཡོན་ཏན་ཆོས་སུ་གྱུར་པ་ཤེས་རབ་སྟོབས།
en: Who has the strength of wisdom, the qualities of the Dharma,

source: །དྲང་སྲོང་ཡེ་ཤེས་སྟོབས་ཀྱིས་མངོན་པར་ཤེས།
en: Who with the strength of knowledge has the higher cognitions of the sages,

source: །ཚིག་ནི་ཐབས་མཁས་པ་ཡི་ངེས་པའི་ཚིག །བརྟགས་པ་ཙམ་དུ་བརྟགས་ནས་བརྗོད་པ་ཡིན།
en: And who has skill in methods of speech and knows the definitions of words. {31} “ ‘The appellations that are spoken are merely appellations;

source: །འཁོར་བ་ལ་ནི་མཐའ་མ་མི་རྙེད་དེ།
en: Within saṃsāra there is no end to be found.

source: །གང་དག་སྔོན་བྱུང་མཐའ་ནི་མཚན་ཉིད་མེད།
en: That which was in the past is devoid of characteristics,

source: །མ་འོངས་དུས་ཀྱང་ཤེས་པར་བྱ་བའི་ཕྱིར།
en: And one should be certain that the future is the same. {32}

source: །ལས་དང་བྱ་བས་དེ་ལྟར་ཞུགས་གྱུར་ཏེ།
en: “ ‘Through engaging in creating karma

source: །རབ་དང་ཐ་མ་དག་ཏུའང་འབྱུང་བར་འགྱུར།
en: There will be the best and the worst.

source: །ཆོས་རྣམས་རྟག་ཏུ་དབེན་ཞིང་རང་བཞིན་སྟོང་། །ཐམས་ཅད་བདག་མེད་པར་ཡང་ཤེས་པར་གྱིས།
en: Knowing that all things are always empty, Empty by nature, and that all things are without a self, {33}

source: །ཀུན་རྫོབ་ཏུ་ནི་རྒྱལ་བས་ཆོས་བཤད་དེ།
en: “ ‘The Jina thus teaches the relative Dharma:

source: །འདུས་བྱས་འདུས་བྱས་མ་ཡིན་དེ་ལྟར་ལྟོས།
en: Regard the composite and noncomposite in that way.

source: །ཡང་དག་ཉིད་དུ་བདག་དང་མི་མེད་དེ།
en: There truly is no self and no human.

source: །འགྲོ་བ་ཀུན་གྱི་མཚན་ཉིད་དེ་འདྲའོ།
en: That is the characteristic of all beings. {34}

source: །དགེ་དང་ནག་པོའི་ལས་རྣམས་མི་འཇིག་སྟེ།
en: “ ‘Good and bad karma are indestructible.

source: །བདག་གིས་བྱས་པ་དག་ནི་མྱོང་བར་འགྱུར།
en: Whatever I have created I will have to experience;

source: །ལས་ཀྱི་འབྲས་བུ་འཕོ་བར་མི་འགྱུར་ཏེ།
en: The result of one’s actions cannot be transferred to others.

source: །རྒྱུ་མེད་པར་ཡང་མྱོང་བར་མི་འགྱུར་རོ།
en: Nothing is experienced without a cause. {35}

source: །སྲིད་པ་ཐམས་ཅད་སྒྱུ་མ་དབང་མེད་པ།
en: “ ‘All existences are illusory and powerless,

source: །གསོག་དང་གསོབ་ཏུ་གྱུར་པ་དབུ་བ་བཞིན།
en: As insubstantial and insignificant as foam.

source: །སྒྱུ་མ་སྨིག་རྒྱུ་ལྟ་བུར་རྟག་ཏུ་སྟོང་།
en: They are always empty, like illusions and mirages.

source: །སྒྲ་ཡིས་དེ་བཤད་དེ་དག་དབེན་པ་ཡིན།
en: They are taught through words, but are devoid of them. {36}

source: །དེ་ལྟར་རྣམ་པར་རིག་པ་རློམ་སེམས་མེད།
en: “ ‘Understand in that way without having pride.

source: །ཚུལ་ཁྲིམས་ལ་ཡང་ཆགས་པ་མེད་པའི་སེམས།
en: Have correct conduct but without attachment,

source: །བཟོད་པའི་སྟོབས་ཀྱིས་ཅུང་ཟད་མི་རྟོག་སྟེ།
en: With the power of patience have no conceptualization,

source: །དེ་ལྟར་སྤྱོད་པ་མཉམ་པར་གཞག་པར་འགྱུར།
en: And, practicing in that way, rest in equanimity.’ {37}

source: །རྒྱལ་པོ་དེས་ནི་ཇི་ཙམ་ཆོས་རིག་པ།
en: “The king understood the Dharma

source: །དེ་ཙམ་དུ་ནི་རྒྱལ་བ་དེས་བཤད་དེ།
en: That was taught by the Jina.

source: །རྒྱལ་པོས་རྒྱལ་བའི་ཆོས་འདི་ཐོས་ནས་ནི།
en: When the king had heard this Dharma from the Jina,

source: །འཁོར་དང་བཅས་པས་བསླབ་པ་ཡང་དག་བཟུང་།
en: Together with his entourage he took up the training. {38}

source: །རྒྱལ་པོའི་བུ་དེས་ཏིང་འཛིན་འདི་མཉན་ནས།
en: “The king, having heard this samādhi,

source: །དགའ་ཞིང་ཡི་རངས་ཚིག་ཀྱང་འདི་སྐད་སྨྲ།
en: Joyous and happy, said these words:

source: །ཤིན་ཏུ་ལེགས་པར་ཏིང་འཛིན་འདི་བཤད་དེ།
en: ‘This samādhi you have taught is excellent

source: །ཁྱོད་ཀྱི་ཞབས་ལ་བདག་ནི་ཕྱག་འཚལ་ལོ།
en: And I bow down to your feet.’ {39}

source: །དེར་ཡང་སྲོག་ཆགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་དག །
en: “Eighty thousand beings who were there

source: ཡང་དག་དོན་དམ་ངེས་པར་བསྟན་པ་འདི། །ཆོས་ཀྱི་རང་བཞིན་བཟང་པོ་འདི་ཐོས་ནས།
en: Had heard this excellent nature of phenomena, This teaching on the ultimate truth,

source: །དེ་དག་མི་སྐྱེ་བ་ཡི་བཟོད་པ་ཐོབ།
en: And attained the acceptance of birthlessness. {40}

source: །སྐྱེས་བུ་ལ་ནི་སྐྱེ་དང་འགག་པ་མེད།
en: “A person has no origination or cessation,

source: །དེ་བཞིན་ཆོས་འདི་རྟག་ཏུ་སྔ་ནས་དབེན།
en: And likewise these phenomena have always been empty.

source: །དེ་ལྟར་རབ་ཤེས་ཡོངས་སུ་མི་འབྲི་སྟེ།
en: When that is known there is no loss,

source: །རྒྱལ་པོས་མི་སྐྱེ་བཟོད་པ་ཐོབ་པར་གྱུར།
en: And the king attained the acceptance of birthlessness. {41}

source: །དེ་ཚེ་རྒྱལ་པོས་རྒྱལ་སྲིད་རྣམ་སྤངས་ཏེ།
en: “The king renounced his kingdom

source: །རྒྱལ་བ་དེ་ཡི་བསྟན་ལ་རབ་ཏུ་བྱུང་།
en: And entered homelessness in that Jina’s teaching.

source: །རྒྱལ་པོའི་སྲས་ཀྱང་ལྔ་བརྒྱ་མི་ཉུང་བ།
en: And all five hundred princes, no less,

source: །དེ་དག་ཀུན་ཀྱང་རྗེས་སུ་རབ་ཏུ་བྱུང་།
en: Followed him into the homeless state. {42}

source: །རྒྱལ་པོ་སྲས་དང་བཅས་པ་རབ་བྱུང་ནས།
en: “When the king and his princes had entered homelessness,

source: །དེ་ཚེ་སྲོག་ཆགས་མང་པོ་སྟོང་གཞན་ཡང་།
en: Many thousands of other beings also at that time

source: །བདེ་བར་གཤེགས་པའི་དྲུང་དུ་རབ་ཏུ་བྱུང་།
en: Entered homelessness in the presence of the Sugata,

source: །རྒྱལ་བ་དེ་ལ་ཆོས་རྣམས་ཚོལ་བར་བྱེད།
en: Seeking to receive the Dharma of that Jina. {43}

source: །ལོ་ནི་བརྒྱ་ཕྲག་ཉི་ཤུར་ཡོངས་ཚང་བར།
en: “For a full two thousand years

source: །རྒྱལ་བ་དེས་ནི་ཆོས་རྣམས་རབ་ཏུ་བཤད།
en: The Jina taught the Dharma.

source: །རྒྱལ་པོ་བུར་བཅས་སྐྱེ་བོར་བཅས་པ་ཡིས།
en: And the king, his sons, and the people

source: །ལོ་ཡང་བརྒྱ་ཕྲག་ཉི་ཤུར་ཆོས་རྣམས་སྤྱད།
en: Practiced the Dharma for those two thousand years. {44}

source: །དེ་ནས་དུས་ཀྱང་གཞན་དུ་གྱུར་པའི་ཚེ།
en: “And then at a later time

source: །རྒྱལ་བ་དེ་ཡང་ཡོངས་སུ་མྱ་ངན་འདས།
en: The Jina passed into nirvāṇa.

source: །རྒྱལ་བའི་ཉན་ཐོས་རྣམས་ཀྱང་འདས་པར་གྱུར།
en: The Jina’s śrāvakas also passed away

source: །དེ་ཡི་ཆོས་རྣམས་ཀྱང་ནི་ཉུང་བར་གྱུར།
en: And his Dharma became diminished. {45}

source: །དེ་ཚེ་རྒྱལ་པོ་དེ་ཡི་བུ་ཡོད་པ།
en: “At that time there was a prince,

source: །བསོད་ནམས་བློ་གྲོས་དད་ཅིང་དང་བ་སྟེ།
en: Puṇyamatin, who had faith and trust.

source: །དེ་ཡི་ཁྱིམ་དུ་ཉེར་འགྲོ་དགེ་སློང་ཡོད།
en: There was a bhikṣu connected with his family

source: །དེས་ནི་ཏིང་འཛིན་ཞི་བ་འདི་ཡང་བཤད།
en: Who taught to him this samādhi of peace. {46}

source: །དེ་ནི་འཇམ་ཞིང་མཉེན་པར་གྱུར་པ་སྟེ།
en: “The bhikṣu was gentle and mild,

source: །སྲོག་ཆགས་བརྒྱ་སྟོང་དག་གིས་བཀུར་སྟི་བྱས།
en: Honored by a hundred thousand beings,

source: །ལྷ་ཡང་བྱེ་བ་བརྒྱ་དག་ཕྱིར་འབྲང་ཞིང་།
en: Was followed by a billion devas,

source: །གྲོང་དུ་འོངས་ནས་བསྔགས་པ་རྗོད་པར་བྱེད།
en: And was praised when he came to the city. {47}

source: །དེ་ནི་དྲན་དང་ལྡན་ཞིང་རྟོགས་པར་ལྡན།
en: “He had recollection and realization.

source: །བརྟུལ་ཞུགས་བཟང་ཞིང་དེས་པ་ཚུལ་ཁྲིམས་དགའ།
en: He was disciplined and compassionate, and he delighted in correct conduct.

source: །དབྱངས་ཀྱང་སྙན་ཅིང་མི་རྩུབ་འཇམ་པ་སྟེ།
en: His lovely voice was not harsh but gentle,

source: །ཁམས་རྣམས་ཤེས་པའི་དབང་མཆོག་རབ་ཏུ་ཐོབ།
en: And he had attained the power of knowledge of the sensory constituents. {48}

source: །དགེ་སློང་དེ་ནི་སྙན་པའི་འོད་ཅེས་བྱ།
en: “That bhikṣu was named Yaśaḥprabha.

source: །ཆོས་གོས་བྱེ་བ་བརྒྱ་ཡང་རབ་ཏུ་རྙེད།
en: He received a billion Dharma robes.

source: །དེ་ཡི་བསོད་ནམས་སྟོབས་ནི་མི་བཟོད་པས།
en: Unable to endure the strength of his merit

source: །དེ་ཚེ་དགེ་སློང་སྟོང་དག་ཕྲག་དོག་སྐྱེས།
en: A thousand monks became jealous of him. {49}

source: །བསོད་ནམས་སྟོབས་དང་གཟུགས་ཀྱི་སྟོབས་རྣམས་དང་། །ཡེ་ཤེས་སྟོབས་དང་རྫུ་འཕྲུལ་སྟོབས་རྣམས་དང་། །ཚུལ་ཁྲིམས་སྟོབས་དང་ཏིང་འཛིན་སྟོབས་རྣམས་དང་། །ཆོས་ཀྱི་སྟོབས་ཀྱིས་དགེ་སློང་ཡང་དག་འཕགས།
en: “He had the strength of merit and the strength of body, The strength of wisdom and the strength of miracles, The strength of correct conduct, the strength of samādhi, And the strength of the Dharma, and therefore was a superior bhikṣu. {50}

source: །སྐྱེ་བོའི་ཡིད་དུ་འོང་ཞིང་ཕངས་པ་སྟེ།
en: “He delighted and was beloved by people.

source: །དགེ་སློང་དགེ་བསྙེན་དང་ནི་དགེ་སློང་མ།
en: Bhikṣus, upāsakas, and bhikṣuṇīs,

source: །རྒྱལ་བའི་བསྟན་ལ་སེམས་ཅན་གང་དད་པ།
en: Those beings who had faith in the Jina’s teaching,

source: །དེ་དག་གིས་ནི་མཆོད་ཅིང་བཀུར་བ་ཡིན།
en: Made offerings to him and honored him. {51}

source: །རྒྱལ་པོའི་བུ་ནི་དེར་ཡང་གང་བྱུང་བ།
en: “The one who was the king’s son was there,

source: །བསོད་ནམས་བློ་གྲོས་རྟག་ཏུ་དད་མོས་ཏེ།
en: Puṇyamatin, who had constant faith and trust.

source: །དགེ་སློང་མང་པོ་ཡིད་འཁྲུག་རིག་ནས་ནི།
en: When he knew that many bhikṣus had wickedness in mind,

source: །སློབ་དཔོན་དེ་ལ་སྲུང་བ་བྱེད་དུ་བཙུད།
en: He became a protector for his teacher. {52}

source: །སྲོག་ཆགས་དག་ནི་སྟོང་ཕྲག་ལྔ་བརྒྱ་རྣམས།
en: “Five hundred thousand people,

source: །གོ་བགོས་མཚོན་ཆ་རལ་གྲི་དབྱུག་ཐོགས་པ།
en: Armored and holding swords and clubs,

source: །དེ་དག་གིས་ནི་དགེ་སློང་རྟག་ཏུ་བསྐོར།
en: Constantly surrounded the bhikṣu

source: །ཡང་དག་སྤྱོད་པ་མུ་མེད་འཆད་ཅིང་སྨྲ།
en: Who taught the conduct that is endlessly correct. {53}

source: །དེ་ནི་འཁོར་ལ་ཆོས་རྣམས་རབ་སྟོན་ཏེ།
en: “He taught to his followers the Dharma

source: །ཆོས་འདི་བདག་མེད་སྟོང་པ་སྲོག་མེད་འཆད།
en: That phenomena are empty, with no self and no soul.
